# Задача "Провизия"

def provisions():
    a = int(input())
    b = int(input())
    print("Всего", a + b, "шт.")

print("Сколько мешков рыбы и мяса?")
provisions()

print("\nСколько буханок белого и чёрного хлеба?")
provisions()

print("\nСколько вёдер воды и молока?")
provisions()